ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/OBJ/STM32F769DISCOVERY_GCC/mdplay/mdcard_play.c
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2000-2003 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 *  Copyright (C) 2004-2012 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *  Copyright (C) 2015-2017 by TOPPERS PROJECT Educational Working Group.
 * 
 *  上記著作権者は，以下の(1)〜(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 *  $Id: mdcard_play.c 2416 2017-04-15 17:17:32Z roi $
 */

#include <kernel.h>
#include <t_syslog.h>
#include <t_stdlib.h>
#include "syssvc/serial.h"
#include "syssvc/syslog.h"
#include "kernel_cfg.h"
#include "storagedevice.h"
#include "device.h"
#include "sdmmc.h"
#include "stm32f769i_discovery_lcd.h"
#include "stm32f769i_discovery_ts.h"
#include "stm32f769i_discovery_audio.h"
#include "stdio.h"
#include "ff.h"
#include "fcntl.h"
#define _STM32F7XX_H_
#include "mdcard_play.h"
#include "topamelogo.h"


/*
 *  サービスコールのエラーのログ出力
 */
Inline void
svc_perror(const char *file, int_t line, const char *expr, ER ercd)
{
	if (ercd < 0) {
		t_perror(LOG_ERROR, file, line, expr, ercd);
	}
}

#define	SVC_PERROR(expr)	svc_perror(__FILE__, __LINE__, #expr, (expr))


#define TIME_POSX   20
#define TIME_POSY   50
#define DATE_POSX   100
#define DATE_POSY   200
#define FILE_LINE   17
#define CZOOM       6

#define CIRCLE_RADIUS  40
#define LINE_LENGHT    30
#define CIRCLE_XPOS(i) ((i * BSP_LCD_GetXSize()) / 5)
#define CIRCLE_YPOS(i) (BSP_LCD_GetYSize() - CIRCLE_RADIUS - 60)

#define SAVE_NO     2
#define PLAY_NO     3
#define EXEC_NO     4
#define FEXEC_NO    (EXEC_NO+1)
#define MUSIC_COUNT 10000

#define HEAP_START  (IMAGE_SIZE+256*1024)

uint32_t heap_param[2] = {
	(LCD_FB_START_ADDRESS+HEAP_START),
	(8*1024*1024)-HEAP_START
};

static char root_dir[] = "0:";
static volatile int  disp_status = 0;
static volatile int  vol_status = 0;
static volatile int  mode = 0;
static volatile int  sdmode = 0;
static volatile int  admode = 0;
static volatile int  advolume = 50;
static TS_StateTypeDef  TS_State;
static struct dirent2 finfo;
static struct tm2 time;
static char cbuff[260];
static char recname[32];


static FILE_INFO  *pFinfo;
static MUSIC_INFO *pMinfo;
static uint8_t    *iaddr;


static void storagedev_notice(void *psdev, bool_t sw)
{
	int i;
	if(sw)
		vol_status |= 1<<((StorageDevice_t*)psdev)->_sdev_devno;
	else
		vol_status &= ~(1<<((StorageDevice_t*)psdev)->_sdev_devno);
	for(i = 0 ; i < 4 ; i++){
		if((vol_status & (1<<i)) != 0){
			root_dir[0] = '0' + i;
			break;
		}
	}
	syslog_4(LOG_NOTICE, "MEDIA[%08x][%04x][%s] on/off(%d) !", psdev, vol_status, root_dir, sw);
	mode = 1;
	sdmode = 2;
}

static uint32_t get_fat_time(void)
{
	int    reqtime = 0;
#ifndef SAMPLE_PROGRAM
	struct tm2 timedate;

	rtc_get_time(&timedate);
	reqtime  = ((timedate.tm_year-10)<<25)+(timedate.tm_mon<<21)+(timedate.tm_mday<<16);
	reqtime += (timedate.tm_hour<<11)+(timedate.tm_min<<5)+(timedate.tm_sec/2);
#else
	reqtime = 0x00210000;
#endif
	return reqtime;
}

/*
 *  ファイル拡張子チェック
 */
int
_checkext(const char* fpath, const char* ext)
{
	int i, j;
	char c;
	for(i = j = 0 ; i < MAX_PATH && fpath[i] != 0 ; i++){
		if(fpath[i] == '.'){
			j = i;
		}
	}
	if(j == 0)
		return 0;
	i = j + 1;
	for(j = 0 ; i < MAX_PATH && fpath[i] != 0 && ext[j] != 0 ; i++){
		c = fpath[i];
		if(c >= 'a' && c <= 'z')
			c -= 0x20;
		if(c != ext[j])
			return 0;
		j++;
	}
	return j;
}

/*
 *  拡大文字表示
 */
static void
DrawCharZ(uint16_t Xpos, uint16_t Ypos, sFONT *fonts, uint8_t ch, uint32_t textcolor, uint32_t backcolor, int times)
{
	uint32_t i = 0, j = 0;
	uint16_t height, width;
	uint8_t  offset;
	uint8_t  *pchar;
	const uint8_t *c;
	uint32_t line;

	height = fonts->Height;
	width  = fonts->Width;
	c = &fonts->table[(ch-' ') * height * ((width + 7) / 8)];
	offset =  8 *((width + 7)/8) -  width ;

	for(i = 0; i < height; i++){
		pchar = ((uint8_t *)c + (width + 7)/8 * i);

		switch(((width + 7)/8)){
		case 1:
			line =  pchar[0];
			break;
		case 2:
			line =  (pchar[0]<< 8) | pchar[1];
			break;
		case 3:
		default:
			line =  (pchar[0]<< 16) | (pchar[1]<< 8) | pchar[2];
			break;
		}

		for (j = 0; j < width; j++){
			if(line & (1 << (width- j + offset- 1)))
				BSP_LCD_SetTextColor(textcolor);
			else
				BSP_LCD_SetTextColor(backcolor);
			BSP_LCD_FillRect((Xpos + j*times), Ypos, times, times);
		}
		Ypos += times;
	}
}

/*
 *  バナー表示
 */
static void
SD_Banner(void)
{
	BSP_LCD_SetFont(&LCD_DEFAULT_FONT);
	BSP_LCD_Clear(LCD_COLOR_BLACK);
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillRect(60, 40, BSP_LCD_GetXSize()-120, BSP_LCD_GetYSize()-80);
	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	BSP_LCD_SetFont(&Font24);
	BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize()/2-60, (uint8_t *)"TOPPERS MEDIA PLAYER", CENTER_MODE);
	BSP_LCD_SetFont(&Font12);
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize()/2-20, (uint8_t *)"TOPPERS BASE PLATFORM V1.3 for stm32f769", CENTER_MODE);
	BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize()/2-4, (uint8_t *)"TOPPERS PROJECT Educational Working Group", CENTER_MODE);
	BSP_LCD_DrawBitmap(BSP_LCD_GetXSize()/2+48, BSP_LCD_GetYSize()/2+20, (uint8_t *)topamelogo);
}

