ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/OBJ/STM32F769DISCOVERY_GCC/mdplay/mdcard_play.c
/*
 *  アイコン表示
 */
static void
SD_SetHint(FILE_INFO *pfinfo, int sno)
{
	static uint8_t ssec = 61;
	StorageDevice_t *psdev;
	int x, y, h;
	int mx, my;

	if((disp_status & (JPEG_APL<<MENU_SHIFT)) != 0)
		return;
	rtc_get_time(&time);
	if(ssec == time.tm_sec)
		return;
	ssec = time.tm_sec;
	h = BSP_LCD_GetYSize() / 4;
	mx = BSP_LCD_GetXSize() - h + 1;
	my = 1;
	BSP_LCD_SetFont(&Font12);
	if((disp_status & CLOCK_APL) != 0){
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
		BSP_LCD_FillRect(mx, my, h-2, h-2);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
		x = mx + 4;
		y = my + 2;
		BSP_LCD_DisplayStringAt(x+12, y, (uint8_t *)"clock", LEFT_MODE);
		if((disp_status & (CLOCK_APL<<MENU_SHIFT)) == 0){
			y += 20;
			sprintf(cbuff, "%02d/%02d/%02d", time.tm_year+1970-2000, time.tm_mon, time.tm_mday);
			BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
			y += 15;
			sprintf(cbuff, "%02d:%02d:%02d", time.tm_hour, time.tm_min, time.tm_sec);
			BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
		}
		else if(sno >= 0){
			BSP_LCD_DisplayStringAt(x+(h/2)-7, y+20, (uint8_t *)"up", LEFT_MODE);
			BSP_LCD_DisplayStringAt(x+(h/2)-14, y+40, (uint8_t *)"down", LEFT_MODE);
		}
	}
	my += h;
	if((disp_status & MEDIA_APL) != 0){
		BSP_LCD_SetTextColor(LCD_COLOR_DARKBLUE);
		BSP_LCD_FillRect(mx, my, h-2, h-2);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_DARKBLUE);
		x = mx + 4;
		y = my + 2;
		BSP_LCD_DisplayStringAt(x+12, y, (uint8_t *)"media", LEFT_MODE);
		psdev = SDMGetStorageDevice(pfinfo->devno);
		if(pfinfo->num_file == 0 || psdev == NULL)
			BSP_LCD_DisplayStringAt(x, y+40, (uint8_t *)"no media", LEFT_MODE);
		else if((psdev->_sdev_attribute & SDEV_DEVERROR) != 0)
			BSP_LCD_DisplayStringAt(x, y+40, (uint8_t *)"error", LEFT_MODE);
		else{
			y += 20;
			cbuff[0] = '[';
			cbuff[1] = pfinfo->devno + '0';
			cbuff[2] = ':';
			cbuff[3] = '/';
			cbuff[4] = ']';
			cbuff[5] = 0;
			BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
			sprintf(cbuff, "%d file", pfinfo->num_file);
			y += 15;
			BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
		}
	}
	my += h;
	if((disp_status & AUDIO_APL) != 0){
		BSP_LCD_SetTextColor(LCD_COLOR_RED);
		BSP_LCD_FillRect(mx, my, h-2, h-2);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_RED);
		x = mx + 4;
		y = my + 2;
		BSP_LCD_DisplayStringAt(x+12, y, (uint8_t *)"audio", LEFT_MODE);
		if(disp_status & (AUDIO_APL<<ACTSHIFT)){
			if((pMinfo->status & AUDIO_PHASE) != 0)
				BSP_LCD_DisplayStringAt(x+8, y+20, (uint8_t *)" stop ", LEFT_MODE);
			else
				BSP_LCD_DisplayStringAt(x+8, y+20, (uint8_t *)"playing", LEFT_MODE);
		}
		else if(pMinfo->reclength > 512 && (disp_status & (AUDIO_APL<<MENU_SHIFT)) != 0
				&& (pMinfo->status & AUDIO_RECODE) == 0)
			BSP_LCD_DisplayStringAt(x+8, y+20, (uint8_t *)"save? ", LEFT_MODE);
	}
	my += h;
	if((disp_status & JPEG_APL) != 0){
		BSP_LCD_SetTextColor(LCD_COLOR_DARKGREEN);
		BSP_LCD_FillRect(mx, my, h-2, h-2);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_DARKGREEN);
		x = mx + 4;
		y = my + 2;
		BSP_LCD_DisplayStringAt(x+12, y, (uint8_t *)"jpeg", LEFT_MODE);
	}
}

/*
 *  クロックメニュー表示
 */
static void
SD_DispTime(int sno, int upmode)
{
	int x = TIME_POSX;
	int y = TIME_POSY;
	int h = BSP_LCD_GetYSize() / 4;
	char *p;
	uint32_t textcolor = LCD_COLOR_BLACK;
	static uint8_t ssec = 61;

	if((disp_status & (JPEG_APL<<MENU_SHIFT)) != 0)
		return;
	rtc_get_time(&time);
	if(ssec == time.tm_sec && sno < 0)
		return;
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillRect(1, 1, BSP_LCD_GetXSize()-h-2, BSP_LCD_GetYSize()-2);
	BSP_LCD_SetFont(&Font24);
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

	if(sno == 3){
		textcolor = LCD_COLOR_BLUE;
		if(upmode > 0 && time.tm_hour < 59)
			time.tm_hour++;
		else if(upmode < 0 && time.tm_hour > 0)
			time.tm_hour--;
	}
	sprintf(cbuff, "%02d", time.tm_hour);
	p = cbuff;
	while(*p > 0){
		DrawCharZ(x, y, &Font24, *p++, textcolor, LCD_COLOR_WHITE, CZOOM);
		x += (Font24.Width-2) * CZOOM;
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_FillRect(x, y+40, CZOOM*2, CZOOM*2);
	BSP_LCD_FillRect(x, y+80, CZOOM*2, CZOOM*2);
	x += 10;
	textcolor = LCD_COLOR_BLACK;
	if(sno == 4){
		textcolor = LCD_COLOR_BLUE;
		if(upmode > 0 && time.tm_min < 59)
			time.tm_min++;
		else if(upmode < 0 && time.tm_min > 0)
			time.tm_min--;
	}
	sprintf(cbuff, "%02d", time.tm_min);
	p = cbuff;
	while(*p > 0){
		DrawCharZ(x, y, &Font24, *p++, textcolor, LCD_COLOR_WHITE, CZOOM);
		x += (Font24.Width-2) * CZOOM;
	}
	x = BSP_LCD_GetXSize() - h - 50;
	y = TIME_POSY-30;
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	if(sno == 5){
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		if(upmode > 0 && time.tm_sec < 59)
			time.tm_sec++;
		else if(upmode < 0 && time.tm_sec > 0)
			time.tm_sec--;
	}
	sprintf(cbuff, "%02d", time.tm_sec);
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);

	x = DATE_POSX;
	y = DATE_POSY;
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	if(sno == 0){
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		if(upmode > 0 && time.tm_year < 130)
			time.tm_year++;
		else if(upmode < 0 && time.tm_year > 30)
			time.tm_year--;
	}
	sprintf(cbuff, "%04d", time.tm_year+1970);
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
	x += 17*4;
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	cbuff[0] = '/';
	cbuff[1] = 0;
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
	x += 17;
	if(sno == 1){
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		if(upmode > 0 && time.tm_mon < 12)
			time.tm_mon++;
		else if(upmode < 0 && time.tm_mon > 1)
			time.tm_mon--;
	}
	sprintf(cbuff, "%02d", time.tm_mon);
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
	x += 17*2;
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	cbuff[0] = '/';
	cbuff[1] = 0;
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
	x += 17;
	if(sno == 2){
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		if(upmode > 0 && time.tm_mday < 31)
			time.tm_mday++;
		else if(upmode < 0 && time.tm_mday > 1)
			time.tm_mday--;
	}
	sprintf(cbuff, "%02d", time.tm_mday);
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);

	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	ssec = time.tm_sec;
	if(sno >= 0 && upmode != 0){
		rtc_set_time(&time);
	}
}

