ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/OBJ/STM32F769DISCOVERY_GCC/mdplay/mdcard_play.c
/*
 *  メディア表示
 */
static void
SD_DispFile(FILE_INFO *pfinfo, int rno)
{
	struct dirent2 *finfo;
	int    no, year, count, len;
	int    x = 5, y = 8;
	int    h = BSP_LCD_GetYSize() / 4;

	if((disp_status & (JPEG_APL<<MENU_SHIFT)) != 0)
		return;
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillRect(1, 1, BSP_LCD_GetXSize()-h-2, BSP_LCD_GetYSize()-2);
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	BSP_LCD_SetFont(&Font12);
	if(pfinfo->num_file == 0){
		BSP_LCD_DisplayStringAt(x, y, (uint8_t *)"no file !", LEFT_MODE);
		return;
	}
	for(count = 0 ; count < pfinfo->num_file && y < (BSP_LCD_GetYSize()-30) ; count++){
		if(count == rno){
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		}
		else{
			BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		}
		memset(cbuff, ' ', sizeof(cbuff));
		len = (BSP_LCD_GetXSize()-h-4) / 7;
		cbuff[len] = 0;
		finfo = &pfinfo->finfo[count];
		sprintf(cbuff, "%02d %s ", count+1, finfo->d_name);
		no = strlen(finfo->d_name);
		for(no += 3 ; no < len ; no++){
			if(cbuff[no] < ' ')
				cbuff[no] = ' ';
		}
		no = len - 22;
		year = (finfo->d_date>>9);
		if(year >= 20)
			year -= 20;
		else
			year += 80;
		sprintf(&cbuff[no], "%02d/%02d/%02d ", year, (finfo->d_date>>5) & 15, finfo->d_date & 31);
		no += 9;
		if(finfo->d_type & AM_DIR)
			strcpy(&cbuff[no], "<DIR>  ");
		else if(finfo->d_type & AM_VOL)
			strcpy(&cbuff[no], "<VOL>  ");
		else{
			sprintf(&cbuff[no], "%d", (int)finfo->d_fsize);
		}
		BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
		y += FILE_LINE;
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	sprintf(cbuff, "%d free blocks %d bytes in a block", (int)pfinfo->fsize, (int)pfinfo->tsize);
	BSP_LCD_DisplayStringAt(x, y, (uint8_t *)cbuff, LEFT_MODE);
}

/*
 *  オーディオ表示
 */
static void
SD_DispAudio(void)
{
	Point Points2[] = {{100, 140}, {160, 180}, {100, 220}};
	int  h = BSP_LCD_GetYSize() / 4;
	int  y = 50;
	int  x = BSP_LCD_GetYSize() / 8;

	if((disp_status & (JPEG_APL<<MENU_SHIFT)) != 0)
		return;
	if(admode == 0)
		return;

	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillRect(1, 1, BSP_LCD_GetXSize()-h-2, BSP_LCD_GetYSize()-2);
	BSP_LCD_SetFont(&Font24);
	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	if((disp_status & (AUDIO_APL<<ACTSHIFT)) != 0){
		if((pMinfo->status & AUDIO_PHASE) != 0){
			BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"      PAUSE     ", CENTER_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_FillRect(100, 140, 80 , 80);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			BSP_LCD_FillPolygon(Points2, 3);
		}
		else{
			BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"     PLAYING    ", CENTER_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_FillPolygon(Points2, 3);
			BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			BSP_LCD_FillRect(100, 140, 25 , 80);
			BSP_LCD_FillRect(140, 140, 25 , 80);
		}
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
		BSP_LCD_FillRect(300, 140, 80 , 80);
	}
	else if((pMinfo->status & AUDIO_RECODE) == 0){
		BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"      STOP      ", CENTER_MODE);
		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(100, 140, 80 , 80);

		if((disp_status & (SCAN_APL<<OPTSHIFT)) != 0){
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			BSP_LCD_FillPolygon(Points2, 3);
		}
		else{
			BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			BSP_LCD_FillRect(100, 140, 25 , 80);
			BSP_LCD_FillRect(140, 140, 25 , 80);
		}
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_FillRect(300, 140, 80 , 80);
	}
	else{
		if((pMinfo->status & AUDIO_PHASE) != 0){
			BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"    SCANNING    ", CENTER_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_FillRect(100, 140, 80 , 80);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			BSP_LCD_FillPolygon(Points2, 3);
		}
		else{
			BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"   RECORDING    ", CENTER_MODE);
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_FillPolygon(Points2, 3);
			BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			BSP_LCD_FillRect(100, 140, 25 , 80);
			BSP_LCD_FillRect(140, 140, 25 , 80);
		}
		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
		BSP_LCD_FillRect(300, 140, 80 , 80);
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	sprintf((char*)cbuff, "   VOL: %3d  ", advolume);
	y += 28;
	BSP_LCD_DisplayStringAt(-x,  y, (uint8_t *)cbuff, CENTER_MODE);

	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	BSP_LCD_FillCircle(CIRCLE_XPOS(2)-x, CIRCLE_YPOS(2), CIRCLE_RADIUS);
	BSP_LCD_FillCircle(CIRCLE_XPOS(3)-x, CIRCLE_YPOS(3), CIRCLE_RADIUS);
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillCircle(CIRCLE_XPOS(2)-x, CIRCLE_YPOS(2), CIRCLE_RADIUS - 2);
	BSP_LCD_FillCircle(CIRCLE_XPOS(3)-x, CIRCLE_YPOS(3), CIRCLE_RADIUS - 2);
	BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	BSP_LCD_DrawHLine(CIRCLE_XPOS(2)-LINE_LENGHT-x, CIRCLE_YPOS(2), 2*LINE_LENGHT);
	BSP_LCD_DrawHLine(CIRCLE_XPOS(3)-LINE_LENGHT-x, CIRCLE_YPOS(3), 2*LINE_LENGHT);
	BSP_LCD_DrawVLine(CIRCLE_XPOS(3)-x, CIRCLE_YPOS(3)-LINE_LENGHT, 2*LINE_LENGHT);

	y = CIRCLE_YPOS(2) - CIRCLE_RADIUS - BSP_LCD_GetFont()->Height;
	BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)"Volume", CENTER_MODE);

	memset(cbuff, ' ', 36);
	cbuff[36] = 0;
	if((disp_status & (SCAN_APL<<OPTSHIFT)) != 0){
		sprintf((char*)cbuff, "save rec:%s", recname);
	}
	y = CIRCLE_YPOS(2) - CIRCLE_RADIUS - BSP_LCD_GetFont()->Height - 30;
	BSP_LCD_DisplayStringAt(-x, y, (uint8_t *)cbuff, CENTER_MODE);
	admode = 0;
}

/*
 *  SD-card Playerメイン表示
 */
static void
sdcard_viewer(StorageDevice_t *psdev, FILE_INFO *pfinfo)
{
	uint16_t x, y, fno, exec = 0;
	uint16_t h = BSP_LCD_GetYSize() / 4;
	int upmode = 0;
	int sno = -1;

	sdmode = 1;
	do{
		SD_SetHint(pfinfo, sno);
		if((disp_status & (CLOCK_APL<<MENU_SHIFT)) != 0)
			SD_DispTime(sno, upmode);
		else if((disp_status & (MEDIA_APL<<MENU_SHIFT)) != 0 && sdmode == 1){
			SD_DispFile(pfinfo, -1);
			sdmode = 0;
			if((psdev->_sdev_attribute & SDEV_DEVERROR) == 0
				&& (psdev->_sdev_attribute & SDEV_EMPLOY) != 0){
				exec = 1;
			}
		}
		else if((disp_status & (AUDIO_APL<<MENU_SHIFT)) != 0)
			SD_DispAudio();
		upmode = 0;
		BSP_TS_GetState(&TS_State);
		if(TS_State.touchDetected){
			/* Get X and Y position of the touch post calibrated */
			x = TS_State.touchX[0];
			y = TS_State.touchY[0];
			syslog_3(LOG_NOTICE, "## detect(%d) x(%d) y(%d) ##", TS_State.touchDetected, x, y);
			if(sno >= 0){
				if(x < (BSP_LCD_GetXSize()-h) || y > h)
					sno = -1;
				else if(y < ((h/3)*2))
					upmode = 1;
				else
					upmode = -1;
			}
			else if(x > (BSP_LCD_GetXSize()-h) && (disp_status & (SCAN_APL<<ACTSHIFT)) == 0){
				if(y < h){
					disp_status &= ~((MEDIA_APL | AUDIO_APL)<<MENU_SHIFT);
					disp_status |= CLOCK_APL<<MENU_SHIFT;
				}
				else if(y < (h*2)){
					disp_status &= ~((CLOCK_APL | AUDIO_APL)<<MENU_SHIFT);
					disp_status |= MEDIA_APL<<MENU_SHIFT;
					int devno = root_dir[0] - '0';
					if(devno == 0 && (vol_status & 2) != 0){
						sdmode = 2;
						mode = 1;
						root_dir[0] = '1';
					}
					else if(devno == 1 && (vol_status & 1) != 0){
						sdmode = 2;
						mode = 1;
						root_dir[0] = '0';
					}
					else
						sdmode = 1;
				}
				else if(y < (h*3)){
					if(pMinfo->reclength > 512 && (disp_status & (AUDIO_APL<<MENU_SHIFT)) != 0)
						mode = SAVE_NO;
					else{
						disp_status &= ~((CLOCK_APL | MEDIA_APL)<<MENU_SHIFT);
						disp_status |= AUDIO_APL<<MENU_SHIFT;
						admode = 1;
					}
				}
				else if(exec != 0)
					mode = EXEC_NO;
			}
			else if((disp_status & (MEDIA_APL<<MENU_SHIFT)) != 0 && y >= 8 && exec != 0){
				fno = (y - 8) / FILE_LINE;
				if(fno < pfinfo->num_file){
					if((pfinfo->finfo[fno].d_dummy & FILE_EXE) != 0){
						SD_DispFile(pfinfo, fno);
						dly_tsk(1000);
						mode = FEXEC_NO+fno;
					}
				}
			}
			else if((disp_status & (AUDIO_APL<<MENU_SHIFT)) != 0){
				if(y >= 140 && y <= 220){
					if(x >= 100 && x <= 180){
						if((disp_status & (AUDIO_APL<<ACTSHIFT)) != 0){
							if((pMinfo->status & AUDIO_PHASE) != 0){
								BSP_AUDIO_OUT_Resume();
								pMinfo->status &= ~AUDIO_PHASE;
							}
							else{
								BSP_AUDIO_OUT_Pause();
								pMinfo->status |= AUDIO_PHASE;
							}
						}
						else if((disp_status & (SCAN_APL<<ACTSHIFT)) != 0){
							if((pMinfo->status & AUDIO_PHASE) != 0)
								pMinfo->status &= ~AUDIO_PHASE;
							else
								pMinfo->status |= AUDIO_PHASE;
						}
						else if(pMinfo->reclength >= 512)
							mode = PLAY_NO;
						admode = 1;
					}
					else if(x >= 300 && x < 380){
						if((disp_status & (AUDIO_APL<<ACTSHIFT)) != 0)
							pMinfo->status |= AUDIO_STOP;
						else if((pMinfo->status & AUDIO_RECODE) != 0)
							pMinfo->status &= ~AUDIO_RECODE;
						else
							act_tsk(SCAN_TASK);
						dly_tsk(200);
						admode = 1;
					}
				}
				if(y >= (CIRCLE_YPOS(2) - CIRCLE_RADIUS) && y <= (CIRCLE_YPOS(2) + CIRCLE_RADIUS)){
					if(x < ((BSP_LCD_GetXSize()-h)/2)){
						if(advolume >= 5)
							advolume -= 5;
						BSP_AUDIO_OUT_SetVolume(advolume);
					}
					else{
						if(advolume <= 95)
							advolume += 5;
						BSP_AUDIO_OUT_SetVolume(advolume);
					}
					admode = 1;
				}
				dly_tsk(300);
			}
			else if((disp_status & (CLOCK_APL<<MENU_SHIFT)) != 0
					&& x < (BSP_LCD_GetXSize()-h) && y < (DATE_POSY+30)){
				if(y > DATE_POSY){
					if(x < (DATE_POSX+17*4))
						sno = 0;
					else if(x < (DATE_POSX+17*7))
						sno = 1;
					else if(x < (DATE_POSX+17*10))
						sno = 2;
				}
				else if(y > 80){
					if(x < ((BSP_LCD_GetXSize()-h)/2))
						sno = 3;
					else
						sno = 4;
				}
				else if(x >= (BSP_LCD_GetXSize()-h-100)){
					sno = 5;
				}
			}
		}
		if((pMinfo->status & AUDIO_EVENT) != 0){
			pMinfo->status &= ~AUDIO_EVENT;
			admode = 1;
		}
		dly_tsk(200);
	}while(mode == 0);
}

