ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/OBJ/STM32F769DISCOVERY_GCC/mdplay/mdcard_play.c
/*
 *  ファイル情報の取得
 */
static int_t
volume_dir(char *arg, FILE_INFO *pfinfo)
{
	StorageDevice_t *psdev;
	struct statfs2  status;
	char   *path, *spath, name[16], *p;
	void   *dir;

	name[0] = 0;
	spath = path = arg;
	pfinfo->devno = SDMGetDeviceNo((const char **)&path);
	pfinfo->num_file = 0;
	pfinfo->num_jpeg = 0;
	pfinfo->tsize = 0;
	pfinfo->fsize = 0;
	psdev = SDMGetStorageDevice(pfinfo->devno);
	if(psdev == 0){
		return -1;
	}
	if((psdev->_sdev_attribute & SDEV_DEVERROR) != 0
			|| (psdev->_sdev_attribute & SDEV_EMPLOY) == 0)
		return -1;
	if(psdev->pdevff == 0 || psdev->pdevff->_sdevff_opendir == 0){
		return -1;
	}
	dir = psdev->pdevff->_sdevff_opendir(spath);
	if(dir != NULL){
		if(*spath == 0){
			name[0] = pfinfo->devno + '0';
			name[1] = ':';
			name[2] = '/';
			name[3] = 0;
			spath = name;
		}
		while(psdev->pdevff->_sdevff_readdir(dir, &finfo) != 0 && finfo.d_name[0] != 0 && pfinfo->num_file < NUM_FILEMAX){
			BCOPY(&finfo, &pfinfo->finfo[pfinfo->num_file], sizeof(struct dirent2));
			pfinfo->finfo[pfinfo->num_file].d_dummy = FILE_ACT;
			p = pfinfo->finfo[pfinfo->num_file].d_name;
			if(_checkext(p, "JPG") != 0){
				pfinfo->finfo[pfinfo->num_file].d_dummy |= FILE_JPEG;
				pfinfo->num_jpeg++;
			}
			else if(_checkext(p, "WAV") != 0)
				pfinfo->finfo[pfinfo->num_file].d_dummy |= FILE_WAV;
			else if(_checkext(p, "MP3") != 0)
				pfinfo->finfo[pfinfo->num_file].d_dummy |= FILE_MP3;
			pfinfo->num_file++;
		}
		psdev->pdevff->_sdevff_closedir(dir);
		if(psdev->pdevff->_sdevff_statfs != 0
			 && psdev->pdevff->_sdevff_statfs(spath, &status) == 0){
			pfinfo->tsize = status.f_bsize;
			pfinfo->fsize = status.f_bfree;
		}
	}
	else{
		syslog_0(LOG_ERROR, "disk error !");
	}
	return 0;
}

static int
music_callback(MUSIC_TRANS *pmtrans)
{
	MUSIC_INFO *pminfo = pmtrans->minfo;
	uint8_t    ret;

	if(pmtrans->mcount == 0){
		ret = BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_BOTH, advolume, pmtrans->samplerate);
		syslog_4(LOG_NOTICE, "## BSP_AUDIO_OUT_Init(%d, %d) (%d) pmtrans[%08x] ##", advolume, pmtrans->samplerate, ret, pmtrans);
		if(ret != AUDIO_OK)
			return -1;
		if(pmtrans->channels == 4)
			BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_0123);
		else
			BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
	}
	else if(pmtrans->mcount == 1){
		syslog_2(LOG_NOTICE, "## BSP_AUDIO_OUT_Play pbuffer[%08x] size[%08x] ##", pminfo->pbuffer, pminfo->buffsize);
		BSP_AUDIO_OUT_Play((uint16_t *)pminfo->pbuffer, pminfo->buffsize);
	}
	return 0;
}

static int
scan_callback(MUSIC_TRANS *pmtrans)
{
	MUSIC_INFO *pminfo = pmtrans->minfo;
	uint8_t    ret;

	if(pmtrans->mcount == 0){
		ret = BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE, advolume, BSP_AUDIO_FREQUENCY_44K);
		syslog_3(LOG_NOTICE, "## BSP_AUDIO_OUT_Init(%d) (%d) pmtrans[%08x] ##", advolume, ret, pmtrans);
		if(ret != AUDIO_OK)
			return -1;
		if(pminfo->datasize > 2)
			BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_0123);
		else
			BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
		syslog_3(LOG_NOTICE, "## BSP_AUDIO_OUT_Play c(%d) addr[%08x] size[%08x] ##", pminfo->datasize, pminfo->pbuffer, pminfo->buffsize);
		BSP_AUDIO_OUT_Play((uint16_t *)pminfo->pbuffer, pminfo->buffsize);
	}
	else if(pmtrans->mcount == 1){
		BSP_AUDIO_OUT_Stop(CODEC_PDWN_HW);
	}
	return 0;
}

#if _DRIVES > 1
/*
 *  USB HOST INFORMATION CALLBACK
 *  parameter1:  Host Handler
 *  parameter2:  Device Handler
 *  parameter3:  Host state ID.
 */
static void USBH_UserProcess(USBH_HandleTypeDef *phost, TUSBH_Device_t *pdevice, uint8_t id)
{
	if(pdevice->pClass != NULL){
		syslog_3(LOG_NOTICE, "## CLASS[%s](%d)(%d) ##", pdevice->pClass->Name, pdevice->type, id);
	}
}
#endif

/*
 *  メインタスク
 */
void main_task(intptr_t exinf)
{
	struct stat buf;
	StorageDevice_t *psdev;
#if _DRIVES > 1
	USB_OTG_Init_t USB_Data_Init;
	USB_OTG_Handle_t *phusb;
	USBH_HandleTypeDef *phusbh;
	TUSBH_ERCODE  result;
#endif
	ER ercd;
	int width, height, size, fno, no;
	int x, y, lcount, vcount, i;
	uint8_t status = 0;

	SVC_PERROR(syslog_msk_log(LOG_UPTO(LOG_INFO), LOG_UPTO(LOG_EMERG)));
	syslog(LOG_NOTICE, "Sample program starts (exinf = %d).", (int_t) exinf);

	/*
	 *  シリアルポートの初期化
	 *
	 *  システムログタスクと同じシリアルポートを使う場合など，シリアル
	 *  ポートがオープン済みの場合にはここでE_OBJエラーになるが，支障は
	 *  ない．
	 */
	ercd = serial_opn_por(TASK_PORTID);
	if (ercd < 0 && MERCD(ercd) != E_OBJ) {
		syslog(LOG_ERROR, "%s (%d) reported by `serial_opn_por'.",
									itron_strerror(ercd), SERCD(ercd));
	}
	SVC_PERROR(serial_ctl_por(TASK_PORTID,
							(IOCTL_CRLF | IOCTL_FCSND | IOCTL_FCRCV)));

	syslog_0(LOG_NOTICE, "### START LCD ###");
	BSP_LCD_Init();
	BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);
 	/* Set LCD Foreground Layer  */
	BSP_LCD_SelectLayer(0);
	SD_Banner();
	syslog_0(LOG_NOTICE, "### END LCD ###");

	psdev = SDMGetStorageDevice(0);
	psdev->_sdev_notice = storagedev_notice;
	SDeviceHead._get_datetime = get_fat_time;
	width  = BSP_LCD_GetXSize();
	height = BSP_LCD_GetYSize();
	pFinfo = (FILE_INFO *)malloc(sizeof(FILE_INFO));
	iaddr  = (uint8_t *)malloc(PPM_OUTSIZE+BMP_HEAD_SIZE);
	syslog_2(LOG_NOTICE, "## DISP finfo[%08x] iaddr[%08x] ##", pFinfo, iaddr);
	syslog_2(LOG_NOTICE, "## SCREEN SIZE %d x %d ##", BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
	status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
	if(status != TS_OK){
		syslog_1(LOG_ERROR, "TS ERROR(%d) !", status);
 	}
	rtc_get_time(&time);
	if(time.tm_year == 30){
		time.tm_year = 17 + 30;
		dly_tsk(5);
		rtc_set_time(&time);
	}
#if _DRIVES > 1
    USB_Data_Init.usb_otg_mode = USB_OTG_MODE;
	USB_Data_Init.host_channels = 11;	/* HOST */
	USB_Data_Init.dev_endpoints = 4;		/* DEV */
	USB_Data_Init.use_dedicated_ep1 = 0;	/* DEV */
	USB_Data_Init.dma_enable = 1;
	USB_Data_Init.low_power_enable = 0;
	USB_Data_Init.phy_itface = USB_PHY_ULPI; 
	USB_Data_Init.sof_enable = 0;
	USB_Data_Init.speed = USB_SPEED_HIGH;
	USB_Data_Init.vbus_sensing_enable = 0;	/* HOST/DEV */
	USB_Data_Init.use_external_vbus = 1;
	phusb = usbo_init(USB2_PORTID, &USB_Data_Init);

