ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/OBJ/STM32F769DISCOVERY_GCC/mdplay/mdcard_play.c
	/*
	 *  USB HOSTミドルウェア設定
	 */
	phusbh = (USBH_HandleTypeDef *)malloc(sizeof(USBH_HandleTypeDef));
	phusbh->pSysData = phusb;
	tusbhInit(phusbh, USBH_UserProcess, 0);
	psdev = SDMGetStorageDevice(MSC_DEVNO);
	psdev->_sdev_local[1] = phusbh;
	psdev->_sdev_notice = storagedev_notice;

	/*
	 *  USB HOSTスタート
	 */
	result = tusbhStart(phusbh);
	syslog_1(LOG_NOTICE, "USB HOST START result(%d) !", result);
#endif
	dly_tsk(2000);

	pMinfo = AUDIO_Hard_Init(AUDIO1_PORTID);
	act_tsk(AUDIO_TASK);
	if(volume_dir(root_dir, pFinfo) == 0)
		sdmode = 1;
	BSP_LCD_Clear(LCD_COLOR_BLACK);
	if(pFinfo->num_file == 0)
		disp_status = ALL_APL | (CLOCK_APL<<MENU_SHIFT);
	else
		disp_status = ALL_APL | (MEDIA_APL<<MENU_SHIFT);
	while(mode < (FEXEC_NO+NUM_FILEMAX)){
		if(sdmode == 2){
			volume_dir(root_dir, pFinfo);
			sdmode = 1;
		}
		mode = 0;
		psdev = SDMGetStorageDevice(root_dir[0]-'0');
		sdcard_viewer(psdev, pFinfo);
		dly_tsk(200);
		if((psdev->_sdev_attribute & SDEV_DEVERROR) != 0)
			continue;
		if(mode == PLAY_NO && pMinfo->reclength >= 512){
			MUSIC_TRANS mtrans;
			mtrans.minfo = pMinfo;
			mtrans.func  = music_callback;
			disp_status |= SCAN_APL<<OPTSHIFT;
			admode = 1;
			SD_DispAudio();
			wav_player(&mtrans);
			BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
			disp_status &= ~(SCAN_APL<<OPTSHIFT);
			admode = 1;
			continue;
		}
		if((psdev->_sdev_attribute & SDEV_EMPLOY) == 0)
			continue;
		if(mode < EXEC_NO){
			if(mode == SAVE_NO && pMinfo->reclength >= 512){
				MUSIC_TRANS mtrans;
				mtrans.minfo = pMinfo;
				memcpy(recname, root_dir, 2);
				strcpy(&recname[2], "rec01.wav");
				disp_status |= SCAN_APL<<OPTSHIFT;
				admode = 1;
				SD_DispAudio();
				dly_tsk(100);
				syslog_0(LOG_NOTICE, "save start !");
				if((pMinfo->fileid = fopen(recname, "wb")) != NULL){
					wav_write(&mtrans);
					syslog_0(LOG_NOTICE, "close wav !");
					fclose(pMinfo->fileid);
					syslog_0(LOG_NOTICE, "write END !");
				}
				disp_status &= ~(SCAN_APL<<OPTSHIFT);
				pMinfo->reclength = 0;
				admode = 1;
			}
			continue;
		}

		if(mode == EXEC_NO){
			lcount = pFinfo->num_jpeg;
			vcount = 100;
			fno = 0;
		}
		else{
			vcount = 200;
			fno = mode - FEXEC_NO;
			if((pFinfo->finfo[fno].d_dummy & (FILE_WAV|FILE_MP3)) != 0)
				lcount = MUSIC_COUNT;
			else
				lcount = 1;
		}
		while(lcount > 0){
			i = fno;
			fno++;
			if((pFinfo->finfo[i].d_dummy & (FILE_WAV|FILE_MP3)) != 0 && lcount == MUSIC_COUNT){
				lcount = 0;
				if((disp_status & (AUDIO_APL<<ACTSHIFT)) != 0)
					continue;
				strcpy(cbuff, root_dir);
				no = strlen(cbuff);
				strcpy(&cbuff[no], pFinfo->finfo[i].d_name);
				if(stat(cbuff, &buf) == 0 &&
					(pMinfo->fileid = fopen(cbuff, "rb")) != NULL) {
					pMinfo->datasize = buf.st_size;
					syslog_1(LOG_NOTICE, "## music data size[%08x] ##", pMinfo->datasize);
					if((pFinfo->finfo[i].d_dummy & FILE_WAV) != 0)
						set_flg(AUDIO_FLG, SET_WAV);
					else
						set_flg(AUDIO_FLG, SET_MP3);
				}
				continue;
			}
			else if((pFinfo->finfo[i].d_dummy & FILE_JPEG) == 0)
				continue;
			syslog_1(LOG_NOTICE, "## lcount(%d) ##", lcount);
			lcount--;
			disp_status |= (JPEG_APL<<MENU_SHIFT);
			strcpy(cbuff, root_dir);
			no = strlen(cbuff);
			strcpy(&cbuff[no], pFinfo->finfo[i].d_name);
			size = jpeg2ppm(cbuff, (uint8_t *)iaddr + BMP_HEAD_SIZE - P6_HEAD_SIZE, PPM_OUTSIZE);
			if(size == 0){
				syslog_0(LOG_ERROR, "convert jpeg to pmm error !");
				free(iaddr);
				disp_status &= ~(JPEG_APL<<MENU_SHIFT);
				continue;
			}

			syslog_2(LOG_NOTICE, "jpeg[%s][%08x]", pFinfo->finfo[i].d_name, size);
			size = ppm2rgb(iaddr, &width, &height);
			syslog_3(LOG_NOTICE, "%d %d [%08x]", width, height, size);
			BSP_LCD_Clear(LCD_COLOR_BLACK);
			x = (BSP_LCD_GetXSize() - width)/2;
			if(x < 0)
				x = 0;
			y = (BSP_LCD_GetYSize() - height)/2;
			if(y < 0)
				y = 0;
			BSP_LCD_DrawBitmap(x, y, (uint8_t *)iaddr);
			if(height > BSP_LCD_GetYSize()){
				iaddr[22] = BSP_LCD_GetYSize() & 0xff;
				iaddr[23] = BSP_LCD_GetYSize() >> 8;
			}
			for(i = 0 ; i < vcount ; i++){
				BSP_TS_GetState(&TS_State);
				if(TS_State.touchDetected){
					lcount = 0;
					break;
				}
				dly_tsk(100);
			}
			disp_status &= ~(JPEG_APL<<MENU_SHIFT);
			BSP_LCD_Clear(LCD_COLOR_BLACK);
			if(lcount == 0)
				dly_tsk(600);
			else
				dly_tsk(200);
		}
		syslog_0(LOG_NOTICE, "## end ##");
	}

	free(iaddr);
	syslog(LOG_NOTICE, "Sample program ends.");
	SVC_PERROR(ext_ker());
	assert(0);
}

/*
 *  AUDIOタスク
 */
void audio_task(intptr_t exinf)
{
	MUSIC_TRANS mtrans;
	FLGPTN   flgptn;

	for(;;){
		wai_flg(AUDIO_FLG, (SET_WAV | SET_MP3), TWF_ORW, &flgptn);
		disp_status |= (AUDIO_APL<<ACTSHIFT);
		mtrans.minfo = pMinfo;
		mtrans.func  = music_callback;
		if((flgptn & SET_WAV) != 0)
			wav_transfar(&mtrans);
		else
			mp3_decode(&mtrans);
		BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
		fclose(pMinfo->fileid);
		disp_status &= ~(AUDIO_APL<<ACTSHIFT);
		admode = 1;
		syslog_0(LOG_NOTICE, "## STOP ##");
	}
	slp_tsk();
}

/*
 *  マイクスキャンタスク
 */
void scan_task(intptr_t exinf)
{
	MUSIC_TRANS mtrans;
	uint32_t    reclength;

	disp_status |= SCAN_APL<<ACTSHIFT;
	mtrans.minfo = pMinfo;
	mtrans.func  = scan_callback;

	if(BSP_AUDIO_IN_Init(BSP_AUDIO_FREQUENCY_44K, DEFAULT_AUDIO_IN_BIT_RESOLUTION, 2*DEFAULT_AUDIO_IN_CHANNEL_NBR) != AUDIO_OK){
		disp_status &= ~(SCAN_APL<<ACTSHIFT);
		return;
	}
	pMinfo->status |= (AUDIO_RECODE | AUDIO_PHASE);
	BSP_AUDIO_IN_AllocScratch(pMinfo->sbuffer, SCRATCH_BUFF_SIZE);
	BSP_AUDIO_IN_Record(pMinfo->rbuffer, RECORD_BUFFER_SIZE);
	pMinfo->datasize = BSP_AUDIO_IN_GetChannelNumber();
	reclength = rectransfer(&mtrans);
	syslog_1(LOG_NOTICE, "scan_task:reclength(%d)", reclength);

	BSP_AUDIO_IN_Stop();
	BSP_AUDIO_IN_DeInit(); 
	pMinfo->status &= ~(AUDIO_RECODE | AUDIO_PHASE);
	disp_status &= ~(SCAN_APL<<ACTSHIFT);
	pMinfo->status |= AUDIO_EVENT;
}

